import numpy as np

# Рядки — Магазини (Магазин 1, Магазин 2, Магазин 3)
# Стовпчики — Дні (День 1, День 2, День 3, День 4)
sales = np.array([
    [10.5, 12.0, 15.0, 18.0],  # Магазин 1
    [ 8.0,  9.5, 11.0, 10.0],  # Магазин 2
    [20.0, 22.5, 25.0, 30.0]   # Магазин 3
])
#Загальна статистика БЕЗ axis (по всій матриці):
sum_sales = np.sum(sales) #Загальна сума по всьому sales 
sales_mean = np.mean(sales) #Обчислення середньої виручки по sales

#Статистика ПО ДНЯХ 
days_sum = np.sum(sales, axis=0) #Обчислення загальної суми по днях

#Статистика ПО МАГАЗИНАХ
shop_mean = np.mean(sales, axis=1) #Обчислення середнього значення виручки магазинів 

#Форматований вивід 
print(f"Загальна сума по всій матриці: {sum_sales:.2f}")
print(f"Середня виручка по всій матриці: {sales_mean:.2f}")
print(f"Загальна сума по днях: {np.round(days_sum, 2)}")
print(f"Середнє значення виручки магазинів: {np.round(shop_mean, 2)}")
