#Аналіз сигналів серцевого ритму
import numpy as np
ecg_signal = np.arange(20)
print("Розмірність масиву:", ecg_signal.shape)

#Порядок зчитування елементів
ecg_c = ecg_signal.reshape(4, 5, order='C') 
#створюємо матрицю 4 рядка 5 стовпця і бере перших 2 елементи(0, 1) і це перший рядок і т.д
ech_f = ecg_signal.reshape(4, 5, order='F')
print("Порядок зчитування елементів(по рядкам):", ecg_c)
print("Порядок зчитування елементів(по стовпцям):", ech_f)

#Використання магічного індексу -1
ecg_mm = ecg_signal.reshape(2, -1) #за формулою вийде 2 рядка а стовпців(20/2=10) 10 стовпців
print("Розмірність нашого масиву:", ecg_mm)

#Перевірка різниці між .flatten() та .ravel()
flat_copy = ecg_c.flatten() #Створює новий масив не змінюючи основний
rav_view = ecg_c.ravel() #змінює масив і не створює новий масив
flat_copy[0] = 6789
rav_view[0] = 34521
print("Новий масив, який не змінює основний:", flat_copy)
print("Масив, який змінює дані основного масиву:", rav_view)
print("Основний масив:", ecg_c)

