import numpy as np

#Аналіз характеристик персонажів гри
#Стовпчики (Характеристики): [HP (Здоров'я), Mana (Мана), Attack (Атака), Defense (Захист)]
stats = np.array([
    [500, 50, 80, 100],   # Воїн (0)
    [200, 400, 120, 30],  # Маг (1)
    [300, 150, 110, 50],  # Лучник (2)
    [450, 200, 70, 120]   # Паладин (3)
])

#Точкова індексація (Один конкретний елемент)
archer_attack = stats[2, 2] # 2 рядок 2 стовпчик
print("Атака лучника:", archer_attack)

#Зріз рядка та стовпчика (Смуги даних)
mage_stats = stats[1, :]
all_defense = stats[:, 3]
print("Усі характеристика мага:", mage_stats)
print("Характеристика захисту у всіх персонажів:", all_defense)

#Зріз підматриці та перевірка .copy()
battle_buffer = stats[1:3, 1:3].copy() #рядки від 1 до 2 та стовпчики від 1 до 2
#змінити найперший елемент цієї копії 
battle_buffer[0, 0] = 9999
print("Оригінальна матриця:", stats)
print("Зріз матриці без зміни основної матриці:", battle_buffer)

