import numpy as np
#Індексація та зрізи 
sales = np.array([
    [100, 150, 200, 250],  # День 0
    [120, 180, 220, 290],  # День 1
    [110, 160, 210, 260],  # День 2
    [140, 190, 240, 300]   # День 3
])

#Точкова індексація (Один конкретний елемент)
single_sale = sales[2, 3]
print("День 2 та стовпчик 2 за нумерацією:", single_sale)

#Витягнути всі продажі за день 1 і відділу 0
day_1_sales = sales[1, :]
dept_0_sales = sales[:, 0]
print("Усі прожажі за день 1:", day_1_sales)
print("Усі продажі відділу 0:", dept_0_sales)

#Зріз підматриці (Шматок даних)
top_departments = sales[0:2, 1:3].copy() #нам треба рядок 0 та 1 стовпчик 1 та 2 але щоб не змінювати основний масив додали .copy()
#потрібно змінити самий перший елемент нашої копії 
top_departments[0, 0] = 999
print("Оригінальна матриця:", sales)
print("Зріз підматриці не змінюючи основної:", top_departments)

