import numpy as np

#Аналіз температурних датчиків
#Стовпчики (Час виміру): [0: Ранок, 1: День, 2: Вечір, 3: Ніч]
#Рядки (Кімнати): [0: Вітальня, 1: Спальня, 2: Кухня, 3: Кабінет]
temperatures = np.array([
    [21.5, 24.0, 22.5, 20.0],  # Вітальня (0)
    [19.0, 21.5, 20.5, 18.5],  # Спальня (1)
    [22.0, 25.5, 24.0, 21.0],  # Кухня (2)
    [20.0, 23.0, 21.5, 19.5]   # Кабінет (3)
])
#Точкова індексація (Один конкретний елемент)
kitchen_day_temp = temperatures[2,1]
print("Температура кухні вдень:", kitchen_day_temp)

#Зріз рядка та стовпчика (Смуги даних)
bedroom_temps = temperatures[1, :]
evening_temps = temperatures[:, 2]
print("Усі показники температури у спальні за весь день:", bedroom_temps)
print("Усі показники температури у вечері у всіх кімнатах:", evening_temps)

#Зріз підматриці та перевірка .copy()
climate_test_buffer = temperatures[0:2, 1:3].copy() #рядки від 0 до 1 стовпчики від 1 до 2 створюється окремий масив не змінюючи основний
climate_test_buffer[0, 0] = 18
print("Основна матриця:", temperatures)
print("Зріз матриці без зміни основної матриці:", climate_test_buffer)


