import numpy as np

# Рядки — Сайти (Сайт A, Сайт B, Сайт C)
# Стовпчики — Дні (Пн, Вт, Ср, Чт, Пт)
traffic = np.array([
    [1200, 1250, 1180, 1300, 1220],       # Сайт A (стабільний)
    [ 500,  520, 15000,  510,  530],       # Сайт B (викид у середу: 15 000!)
    [2000, 2100, 2050, 1980, 2020]        # Сайт C (високий відвідуваність)
])

#Порівняння середнього та медіани для кожного сайту
side_mean = np.mean(traffic, axis=1) 
side_median = np.median(traffic, axis=1)

#Вивід 
print(f"Середня кількість відвідувачів для кожного з сайтів: {np.round(side_mean, 2)}")
print(f"Медіана кожного сайту: {np.round(side_median, 2)}")

#Оцінка волатильності (розкиду) трафіку по днях для 3 сайтів
std_side = np.std(traffic, axis=0)
print(f"Стандартне відхилення трафіку по днях для кожного з сайтів: {np.round(std_side, 2)}")

#Загальний розкид трафіку БЕЗ axis:
std_trafic = np.std(traffic)
print(f"Загальне відхилення по всьому трафіку: {std_trafic:.2f}")

